Repository: BGirginn/journal
Catalog: lib/l10n/app_*.arb
Languages: tr

# profileSettingsTitle
source: Profile & Settings
tr: Profil ve Ayarlar

# settingsTitle
source: SETTINGS
tr: AYARLAR

# appearanceTitle
source: Appearance
tr: Görünüm

# themeModeTitle
source: Theme Mode
tr: Tema Modu

# themeSystem
source: System
tr: Sistem

# themeLight
source: Light
tr: Açık

# themeDark
source: Dark
tr: Koyu

# accountTitle
source: Account
tr: Hesap

source: Sign Out
tr: Çıkış Yap

# signOutConfirmTitle
source: Sign Out
tr: Çıkış Yap

# signOutConfirmMessage
source: Are you sure you want to sign out?
tr: Çıkış yapmak istediğinize emin misiniz?

source: Cancel
tr: İptal

# aboutTitle
source: About
tr: Hakkında

source: Version
tr: Sürüm

source: Licenses
tr: Lisanslar

source: Loading...
tr: Yükleniyor...

# errorPrefix
source: Error
tr: Hata

# copyUsernameSuccess
source: Username copied
tr: Kullanıcı adı kopyalandı

# copyUsernameTooltip
source: Copy Username
tr: Kullanıcı Adını Kopyala

source: Language
tr: Dil

# languageSystem
source: System Default
tr: Sistem Varsayılanı

# languageTurkish
source: Turkish
tr: Türkçe

# languageEnglish
source: English
tr: İngilizce

# onboardingTitleCaptureMemories
source: Capture Your Memories
tr: Anılarınızı Kaydedin

# onboardingDescCaptureMemories
source: Build your personal journal with text, photo, video, and audio. Keep every memory alive on a unique page.
tr: Metin, fotoğraf, video ve ses kayıtları ile özel günlüğünüzü oluşturun. Her anı benzersiz bir sayfada yaşatın.

# onboardingTitleShareTogether
source: Share Together
tr: Birlikte Paylaşın

# onboardingDescShareTogether
source: Create teams, invite friends, and keep shared journals together. Memories become more meaningful when shared.
tr: Takımlar oluşturun, arkadaşlarınızı davet edin ve birlikte ortak günlükler tutun. Anılar paylaşıldığında daha değerli olur.

# onboardingTitlePersonalize
source: Personalize It
tr: Kişiselleştirin

# onboardingDescPersonalize
source: Make your journal your own with nostalgic themes, stickers, and drawing tools.
tr: Nostaljik temalar, stickerlar ve çizim araçlarıyla günlüğünüzü tamamen kişiselleştirin.

# onboardingSkip
source: Skip
tr: Atla

# onboardingNext
source: Next
tr: İleri

# onboardingGetStarted
source: Get Started
tr: Başlayalım!

# loginTagline
source: Preserve your memories with a modern touch
tr: Anılarını modern bir dokunuşla sakla

# loginProfileChecking
source: Checking profile...
tr: Profil kontrol ediliyor...

# loginGoogleSignIn
source: Continue with Gmail
tr: Gmail ile Giriş Yap

# loginAppleSignIn
source: Sign in with Apple
tr: Apple ile Giriş Yap

# loginAccountExistsWithGoogleTitle
source: Use Google to Continue
tr: Google ile Devam Et

# loginAccountExistsWithGoogleMessage
source: This email is already registered with your Google account.
tr: Bu e-posta Google hesabınla kayıtlı.

# loginContinueWithGoogle
source: Continue with Google
tr: Google ile Devam Et

# loginCanLinkAppleLater
source: After signing in with Google, you can link Apple from Profile settings.
tr: Google ile giriş yaptıktan sonra Apple hesabını Profil ayarlarından bağlayabilirsin.

# loginAppleIOSOnly
source: Apple Sign-In is available only on iOS.
tr: Apple ile giriş sadece iOS'ta kullanılabilir.

# loginAppleMissingToken
source: Apple identity token could not be retrieved.
tr: Apple kimlik tokeni alınamadı.

# loginAppleInvalidCredential
source: Apple credential is invalid.
tr: Apple kimlik bilgisi geçersiz.

# loginAppleProviderNotEnabled
source: Apple Sign-In is not enabled in Firebase Auth provider settings.
tr: Firebase Authentication içinde Apple sağlayıcısı etkin değil.

# loginAppleAuthorizationFailed
source: Apple authorization failed. Check Apple ID session on device/simulator.
tr: Apple yetkilendirmesi başarısız. Cihaz/simülatörde Apple ID oturumunu kontrol edin.

# loginAppleCredentialRequestFailed
source: Apple credential request failed. Please try again.
tr: Apple kimlik bilgisi alınamadı. Lütfen tekrar deneyin.

# loginAppleFlowTimeout
source: Apple sign-in dialog did not respond. Sign out/in Apple ID on simulator and try again.
tr: Apple giriş penceresi yanıt vermedi. Simülatörde Apple hesabından çıkış yapıp tekrar deneyin.

# loginGoogleConfigError
source: Google Sign-In configuration is invalid.
tr: Google giriş yapılandırması hatalı.

# loginFirebaseUnavailable
source: Firebase could not be initialized.
tr: Firebase başlatılamadı.

# linkedAccountsTitle
source: Linked Accounts
tr: Bağlı Hesaplar

# linkedStatusConnected
source: Connected
tr: Bağlı

# linkedStatusNotConnected
source: Not connected
tr: Bağlı değil

# linkAppleAction
source: Link Apple Account
tr: Apple Hesabını Bağla

# linkAppleSuccess
source: Apple account linked successfully.
tr: Apple hesabı başarıyla bağlandı.

# linkAppleUnsupported
source: Apple account linking is only available on iOS.
tr: Apple hesabı bağlama sadece iOS'ta kullanılabilir.

# linkAppleNeedsRecentLogin
source: Please sign in again before linking Apple.
tr: Apple bağlamak için lütfen tekrar giriş yapın.

# linkAppleAlreadyLinked
source: Apple account is already linked.
tr: Apple hesabı zaten bağlı.

# linkAppleCredentialInUse
source: This Apple account is linked to another user.
tr: Bu Apple hesabı başka bir kullanıcıya bağlı.

# editorPageTitle
source: Page {pageNumber}
tr: Sayfa {pageNumber}

# editorTooltipShare
source: Share
tr: Paylaş

# editorTooltipPreview
source: Preview
tr: Önizle

# editorTooltipSave
source: Save
tr: Kaydet

# editorPdfPreparing
source: Preparing PDF...
tr: PDF hazırlanıyor...

# editorExportPdf
source: Export as PDF
tr: PDF Olarak Dışa Aktar

# editorSaveLocalCloudFail
source: Saved locally, cloud sync failed: {error}
tr: Yerel kaydedildi, bulut senkronizasyonu başarısız: {error}

# editorSaved
source: Saved ✓
tr: Kaydedildi ✓

# editorToolSelect
source: Select
tr: Seç

# editorToolText
source: Text
tr: Metin

# editorToolDraw
source: Draw
tr: Çiz

# editorToolErase
source: Eraser
tr: Silgi

# editorToolMedia
source: Media
tr: Medya

# editorToolTag
source: Tag
tr: Etiket

# editorToolRotate
source: Rotate
tr: Döndür

# editorToolFrame
source: Frame
tr: Çerçeve

# editorToolDelete
source: Delete
tr: Sil

# editorMediaAdd
source: Add Media
tr: Medya Ekle

# editorMediaImage
source: Image
tr: Resim

# editorMediaImageSubtitle
source: Choose from gallery or camera
tr: Galeriden veya kameradan

# editorMediaVideoSubtitle
source: Record or choose a video
tr: Video kaydet veya seç

# editorMediaAudio
source: Audio
tr: Ses

# editorMediaAudioSubtitle
source: Record voice audio
tr: Ses kaydı yap

# editorMediaDrawing
source: Drawing
tr: Çizim

# editorMediaDrawingSubtitle
source: Freehand drawing
tr: Serbest çizim yapın

# editorVideoFromGallery
source: Select from Gallery
tr: Galeriden Seç

# editorVideoFromCamera
source: Record Video
tr: Video Çek

# editorPageTags
source: Page Tags
tr: Sayfa Etiketleri

# editorEraserSize
source: Eraser size
tr: Silgi boyutu

# editorTextPlaceholder
source: Add text...
tr: Yazı ekle...

# editorMicPermissionRequired
source: Microphone permission is required. Please allow it in settings.
tr: Mikrofon izni gerekli. Lütfen ayarlardan izin verin.

# editorRecordError
source: Recording error: {error}
tr: Kayıt hatası: {error}

# editorFrameSelect
source: Select Frame
tr: Çerçeve Seçin

# editorFrameNone
source: None
tr: Yok

# editorFrameRound
source: Round
tr: Yuvarlak

# editorFrameRounded
source: Rounded
tr: Köşeli

# editorFrameTape
source: Tape
tr: Bant

# editorFrameShadow
source: Shadow
tr: Gölge

# editorFrameStacked
source: Stacked
tr: Yığın

# editorFrameSticker
source: Sticker
tr: Etiket

# editorFrameBorder
source: Border
tr: Kenarlık

# editorFrameGradient
source: Gradient
tr: Gradyan

# editorFrameVintage
source: Vintage
tr: Nostalji

# editorFrameLayered
source: Layered
tr: Katman

# editorFrameTapeCorner
source: Tape Corner
tr: Bant Köşe

# editorFramePolaroidClassic
source: Classic Polaroid
tr: Polaroid Klasik

# editorFrameVintageEdge
source: Vintage Edge
tr: Vintage Kenar

# editorDeleteBlockTitle
source: Delete Block
tr: Bloğu Sil

# editorDeleteBlockMessage
source: Are you sure you want to delete this block?
tr: Bu bloğu silmek istediğinizden emin misiniz?

# editorDelete
source: Delete
tr: Sil

# editorRotateImageTitle
source: Rotate Image
tr: Resmi Döndür

# editorCurrentAngle
source: Current angle: {angle}°
tr: Mevcut açı: {angle}°

# editorApply
source: Apply
tr: Uygula

# editorUnsavedTitle
source: Unsaved Changes
tr: Kaydedilmemiş Değişiklikler

# editorUnsavedMessage
source: You have unsaved changes. What would you like to do?
tr: Kaydedilmemiş değişiklikleriniz var. Ne yapmak istersiniz?

# editorExitWithoutSave
source: Exit (Don't Save)
tr: Çık (Kaydetme)

# editorSaveAndExit
source: Save and Exit
tr: Kaydet ve Çık

# editorErrorWithMessage
source: Error: {error}
tr: Hata: {error}

# libraryGreetingMorning
source: Good morning
tr: Gunaydin

# libraryGreetingAfternoon
source: Good afternoon
tr: Iyi gunler

# libraryGreetingEvening
source: Good evening
tr: Iyi aksamlar

# libraryHeaderYourJournals
source: Your Journals
tr: Gunluklerin

# librarySectionSubtitle
source: Pick up where you left off
tr: Kaldigin yerden devam et

# libraryEmptyTitle
source: Start your first journal
tr: Ilk gunlugunu baslat

# libraryEmptySubtitle
source: Capture moments with text, photos, audio, and drawings.
tr: Metin, fotograf, ses ve cizim ile anilarini kaydet.

# libraryEmptyCta
source: Create Journal
tr: Gunluk Olustur

# libraryCreateTitle
source: New Journal
tr: Yeni Gunluk

# libraryCreateHint
source: Example: Travel Notes
tr: Orn: Seyahat Notlarim

# libraryCreateAction
source: Create
tr: Olustur

# libraryActionPreview
source: Live Preview
tr: Canli Onizleme

# libraryActionCustomizeCover
source: Customize Cover
tr: Kapagi Ozellestir

# libraryActionRename
source: Rename
tr: Yeniden Adlandir

# libraryActionDelete
source: Delete
tr: Sil

# libraryPreviewTitle
source: Live Journal Preview
tr: Canli Gunluk Onizlemesi

# libraryRenameTitle
source: Rename Journal
tr: Gunlugu Yeniden Adlandir

# libraryRenameHint
source: Journal title
tr: Gunluk adi

# libraryDeleteTitle
source: Delete Journal
tr: Gunlugu Sil

# libraryDeleteMessage
source: Are you sure you want to delete "{journalTitle}"?
tr: "{journalTitle}" gunlugunu silmek istediginize emin misiniz?

# libraryThemePickerTitle
source: Choose Theme
tr: Tema Secin

# libraryCoverCustomizeTitle
source: Customize Cover
tr: Kapak Ozellestir

# libraryThemeTab
source: Themes
tr: Temalar

# libraryPhotoTab
source: Photo
tr: Fotograf

# libraryUploading
source: Uploading...
tr: Yukleniyor...

# librarySelectFromGallery
source: Select From Gallery
tr: Galeriden Sec

# libraryCustomCoverHint
source: Upload a custom cover photo
tr: Ozel kapak fotografi yukleyin

# libraryUploadError
source: Upload failed: {error}
tr: Yukleme hatasi: {error}
